-- 1. Вывести названия товаров от 50 до 500 EUR

db.products.find(
    { price: { $gte: 50, $lte: 500 }},
    {title: 1, _id: 0}

)

-- END OF TASK-1 ##################################################################


-- 2. Применить скидку в размере 10% к товарам от 50 EUR

db.products.updateMany(
    { price: { $gte: 10} }, // filter
    { $mul: { price: .9 } } // action
)

-- END OF TASK-2 ##################################################################


-- 3. Применить ко всем товарам наценку в размере 5%

db.products.updateMany(
    {}, // filter
    { $mul: { price: 1.05 } } // action
)
-- END OF TASK-3 ##################################################################


-- 4. Заблокировать юзеров не из USA
db.users.updateMany(
    { country: {$ne: "USA"} }, // filter
    { $set: { is_blocked: true } } // action
)
-- END OF TASK-4 ##################################################################

-- 5. Вывести имена незаблокированных юзеров



