-- 1. Вывести названия товаров от 50 до 500 EUR

db.products.find(
    { price: { $gte: 50, $lte: 500 }},
    {title: 1, _id: 0}

)

  -- RESULT:
  -- ______________________________________________________________________________

{
    "title" : "Product 1"
}
{
    "title" : "Product 2"
}
{
    "title" : "Product 3"
}
-- END OF TASK-1 ##################################################################


-- 2. Применить скидку в размере 10% к товарам от 50 EUR
-- 3. Применить ко всем товарам наценку в размере 5%
-- 4. Заблокировать юзеров не из USA
-- 5. Вывести имена незаблокированных юзеров
